In [17]:
import pandas as pd

In [18]:
df1 = pd.DataFrame({'A': [1,2], 'B': [3,4]})
df1

   A  B
0  1  3
1  2  4

In [19]:
df2= pd.DataFrame({'C': [3,4], 'D': [5,6]})
df2

   C  D
0  3  5
1  4  6

In [20]:
df3 = pd.concat([df1, df2], axis=1) #along columns
df3

   A  B  C  D
0  1  3  3  5
1  2  4  4  6

In [21]:
df3 = pd.concat([df1, df2], axis=0) #along row
df3

     A    B    C    D
0  1.0  3.0  NaN  NaN
1  2.0  4.0  NaN  NaN
0  NaN  NaN  3.0  5.0
1  NaN  NaN  4.0  6.0

In [22]:
df4= pd.DataFrame({'A': [7,4], 'B': [5,2]})
df5= pd.DataFrame({'A': [3,4], 'B': [5,6]})

In [23]:
df4

   A  B
0  7  5
1  4  2

In [24]:
df5

   A  B
0  3  5
1  4  6

### USING MERGE

In [36]:
df6= pd.DataFrame({'ID': [1,2,3], 'NAMES': ["Alice","John", "Jane"]})
df6

   ID  NAMES
0   1  Alice
1   2   John
2   3   Jane

In [40]:
df7= pd.DataFrame({'ID': [1,2,5,3], 'Scores': [36,67, 78,45]})
df7

   ID  Scores
0   1      36
1   2      67
2   5      78
3   3      45

## Inner : This returns records present in both tables

In [41]:
pd.merge(df6,df7, on='ID', how='inner')

   ID  NAMES  Scores
0   1  Alice      36
1   2   John      67
2   3   Jane      45

### Left join: This returns all the records in the left table and records present in both tables

In [42]:
pd.merge(df6,df7, on='ID', how='left')

   ID  NAMES  Scores
0   1  Alice      36
1   2   John      67
2   3   Jane      45

## Right Join: This returns all the records in the right table and records present in both tables

In [43]:
pd.merge(df6,df7, on='ID', how='right')

   ID  NAMES  Scores
0   1  Alice      36
1   2   John      67
2   5    NaN      78
3   3   Jane      45

In [45]:
df8 = pd.DataFrame({'Student_ID':[2, 3, 4], 'Score':[85, 90, 95]})
df8

   Student_ID  Score
0           2     85
1           3     90
2           4     95

In [46]:
df6

   ID  NAMES
0   1  Alice
1   2   John
2   3   Jane

In [51]:
df9 = pd.merge(df6, df8, left_on='ID', how='inner', right_on="Student_ID")
df9

   ID NAMES  Student_ID  Score
0   2  John           2     85
1   3  Jane           3     90

In [52]:
df9.drop("Student_ID", axis=1, inplace=True)
df9

   ID NAMES  Score
0   2  John     85
1   3  Jane     90

## Outer join: This returns all records in both tables

In [53]:
pd.merge(df6, df8, left_on='ID', how='outer', right_on="Student_ID")

    ID  NAMES  Student_ID  Score
0  1.0  Alice         NaN    NaN
1  2.0   John         2.0   85.0
2  3.0   Jane         3.0   90.0
3  NaN    NaN         4.0   95.0

## Joining on index

In [54]:
df6

   ID  NAMES
0   1  Alice
1   2   John
2   3   Jane

In [57]:
df6.set_index("ID", inplace=True)
df7.set_index("ID", inplace=True)

In [58]:
df6

    NAMES
ID
1   Alice
2    John
3    Jane

In [59]:
df7

    Scores
ID
1       36
2       67
5       78
3       45

In [60]:
df6.join(df7)

    NAMES  Scores
ID
1   Alice      36
2    John      67
3    Jane      45

In [61]:
df7.join(df6)

    Scores  NAMES
ID
1       36  Alice
2       67   John
5       78    NaN
3       45   Jane